In [1]:
from pyspark.sql import SparkSession
spark=SparkSession.builder.appName('Practice').getOrCreate()

Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).

23/01/04 15:53:58 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
23/01/04 15:53:59 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.
23/01/04 15:53:59 WARN Utils: Service 'SparkUI' could not bind on port 4041. Attempting port 4042.

In [2]:
spark.read.csv('test2.csv',header=True,inferSchema=True).show()

+----+----+----------+------+
|Name| Age|Experience|Salary|
+----+----+----------+------+
| nik|  28|         5| 15000|
|dany|  45|        10| 10000|
| piu|  25|         3| 25000|
| raj|  22|         4| 12000|
| sam|  19|         2| 15200|
|tiku|  26|         5| 53000|
|sanu|null|      null| 45000|
|null|  28|         3| 56000|
|null|  35|      null|  null|
+----+----+----------+------+

In [3]:
df_spark=spark.read.csv('test2.csv',header=True,inferSchema=True)

In [4]:
df_spark.show()

+----+----+----------+------+
|Name| Age|Experience|Salary|
+----+----+----------+------+
| nik|  28|         5| 15000|
|dany|  45|        10| 10000|
| piu|  25|         3| 25000|
| raj|  22|         4| 12000|
| sam|  19|         2| 15200|
|tiku|  26|         5| 53000|
|sanu|null|      null| 45000|
|null|  28|         3| 56000|
|null|  35|      null|  null|
+----+----+----------+------+

## Drop the column

In [5]:
df_spark.drop('Name').show()

+----+----------+------+
| Age|Experience|Salary|
+----+----------+------+
|  28|         5| 15000|
|  45|        10| 10000|
|  25|         3| 25000|
|  22|         4| 12000|
|  19|         2| 15200|
|  26|         5| 53000|
|null|      null| 45000|
|  28|         3| 56000|
|  35|      null|  null|
+----+----------+------+

In [6]:
df_spark.show()

+----+----+----------+------+
|Name| Age|Experience|Salary|
+----+----+----------+------+
| nik|  28|         5| 15000|
|dany|  45|        10| 10000|
| piu|  25|         3| 25000|
| raj|  22|         4| 12000|
| sam|  19|         2| 15200|
|tiku|  26|         5| 53000|
|sanu|null|      null| 45000|
|null|  28|         3| 56000|
|null|  35|      null|  null|
+----+----+----------+------+

In [7]:
df_spark.na.drop().show()

+----+---+----------+------+
|Name|Age|Experience|Salary|
+----+---+----------+------+
| nik| 28|         5| 15000|
|dany| 45|        10| 10000|
| piu| 25|         3| 25000|
| raj| 22|         4| 12000|
| sam| 19|         2| 15200|
|tiku| 26|         5| 53000|
+----+---+----------+------+

In [8]:
### any===how
df_spark.na.drop(how='any').show()

+----+---+----------+------+
|Name|Age|Experience|Salary|
+----+---+----------+------+
| nik| 28|         5| 15000|
|dany| 45|        10| 10000|
| piu| 25|         3| 25000|
| raj| 22|         4| 12000|
| sam| 19|         2| 15200|
|tiku| 26|         5| 53000|
+----+---+----------+------+

In [9]:
 ### Threshold
df_spark.na.drop(how='any',thresh=2).show()

+----+----+----------+------+
|Name| Age|Experience|Salary|
+----+----+----------+------+
| nik|  28|         5| 15000|
|dany|  45|        10| 10000|
| piu|  25|         3| 25000|
| raj|  22|         4| 12000|
| sam|  19|         2| 15200|
|tiku|  26|         5| 53000|
|sanu|null|      null| 45000|
|null|  28|         3| 56000|
+----+----+----------+------+

In [10]:
df_spark.na.drop(how='any',thresh=3).show()

+----+---+----------+------+
|Name|Age|Experience|Salary|
+----+---+----------+------+
| nik| 28|         5| 15000|
|dany| 45|        10| 10000|
| piu| 25|         3| 25000|
| raj| 22|         4| 12000|
| sam| 19|         2| 15200|
|tiku| 26|         5| 53000|
|null| 28|         3| 56000|
+----+---+----------+------+

In [11]:
#### Subset
df_spark.na.drop(how='any',subset=['Experience']).show()

+----+---+----------+------+
|Name|Age|Experience|Salary|
+----+---+----------+------+
| nik| 28|         5| 15000|
|dany| 45|        10| 10000|
| piu| 25|         3| 25000|
| raj| 22|         4| 12000|
| sam| 19|         2| 15200|
|tiku| 26|         5| 53000|
|null| 28|         3| 56000|
+----+---+----------+------+

In [12]:
df_spark.show()

+----+----+----------+------+
|Name| Age|Experience|Salary|
+----+----+----------+------+
| nik|  28|         5| 15000|
|dany|  45|        10| 10000|
| piu|  25|         3| 25000|
| raj|  22|         4| 12000|
| sam|  19|         2| 15200|
|tiku|  26|         5| 53000|
|sanu|null|      null| 45000|
|null|  28|         3| 56000|
|null|  35|      null|  null|
+----+----+----------+------+

In [30]:
#### Fill the missing value

df_spark.na.fill('Missing Value').show()

+-------------+----+----------+------+
|         Name| Age|Experience|Salary|
+-------------+----+----------+------+
|          nik|  28|         5| 15000|
|         dany|  45|        10| 10000|
|          piu|  25|         3| 25000|
|          raj|  22|         4| 12000|
|          sam|  19|         2| 15200|
|         tiku|  26|         5| 53000|
|         sanu|null|      null| 45000|
|Missing Value|  28|         3| 56000|
|Missing Value|  35|      null|  null|
+-------------+----+----------+------+

In [31]:
df_spark.show()

+----+----+----------+------+
|Name| Age|Experience|Salary|
+----+----+----------+------+
| nik|  28|         5| 15000|
|dany|  45|        10| 10000|
| piu|  25|         3| 25000|
| raj|  22|         4| 12000|
| sam|  19|         2| 15200|
|tiku|  26|         5| 53000|
|sanu|null|      null| 45000|
|null|  28|         3| 56000|
|null|  35|      null|  null|
+----+----+----------+------+

In [32]:
from pyspark.ml.feature import Imputer

imputer = Imputer(inputCols=['Age', 'Experience', 'Salary'],
                 outputCols=["{}_imputed".format(c) for c in ['Age','Experience', 'Salary']]
                 ).setStrategy('mean')

In [33]:
## ADD imputation cols to df

imputer.fit(df_spark).transform(df_spark).show()

+----+----+----------+------+-----------+------------------+--------------+
|Name| Age|Experience|Salary|Age_imputed|Experience_imputed|Salary_imputed|
+----+----+----------+------+-----------+------------------+--------------+
| nik|  28|         5| 15000|         28|                 5|         15000|
|dany|  45|        10| 10000|         45|                10|         10000|
| piu|  25|         3| 25000|         25|                 3|         25000|
| raj|  22|         4| 12000|         22|                 4|         12000|
| sam|  19|         2| 15200|         19|                 2|         15200|
|tiku|  26|         5| 53000|         26|                 5|         53000|
|sanu|null|      null| 45000|         28|                 4|         45000|
|null|  28|         3| 56000|         28|                 3|         56000|
|null|  35|      null|  null|         35|                 4|         28900|
+----+----+----------+------+-----------+------------------+--------------+